*** COMMENT examples

    #+BEGIN_SRC emacs-lisp
(aod.org-babel/generate-named-buttons)
    #+END_SRC

    #+RESULTS:
    | [dev:run] | [dev:build] | [demo-sh-2] | [demo-sh] |

    #+BEGIN_SRC emacs-lisp
(aod.org-babel/generate-named-buttons-inc "dev")
    #+END_SRC

    #+RESULTS:
    | [dev:run] | [dev:build] |

    #+BEGIN_SRC emacs-lisp
(aod.org-babel/generate-named-buttons-exc "dev")
    #+END_SRC

    #+RESULTS:
    | [demo-sh-2] | [demo-sh] |

    #+NAME: demo-sh
    #+BEGIN_SRC sh
echo demo
    #+END_SRC

    #+NAME: demo-sh-2
    #+BEGIN_SRC sh
echo demo 2
    #+END_SRC

    #+NAME: dev:build
    #+BEGIN_SRC sh
echo dev build
    #+END_SRC

    #+NAME: dev:run
    #+BEGIN_SRC sh
echo dev run
    #+END_SRC
* Dekstop  (saving configurations)
  #+BEGIN_SRC emacs-lisp
(defun aod.desktop/save ()
  "Save current project dekstop"
  (interactive)
  (desktop-save (projectile-project-root) t nil 208)
  )

(defun aod.desktop/read ()
  "Save current project dekstop"
  (interactive)
  (desktop-read (projectile-project-root))
  )
  #+END_SRC

  #+RESULTS:
  : aod\.desktop/read
